NXP/GenAVB_TSN-rtos-apps/devices/MIMXRT118x/common/cm7/armgcc/startup_MIMXRT118x_cm7.S
    .long   SINC1_CH0_IRQHandler                            /* SINC Filter Glue 1 channel 0*/
    .long   SINC1_CH1_IRQHandler                            /* SINC Filter Glue 1 channel 1*/
    .long   SINC1_CH2_IRQHandler                            /* SINC Filter Glue 1 channel 2*/
    .long   SINC1_CH3_IRQHandler                            /* SINC Filter Glue 1 channel 3*/
    .long   SINC2_CH0_IRQHandler                            /* SINC Filter Glue 2 channel 0*/
    .long   SINC2_CH1_IRQHandler                            /* SINC Filter Glue 2 channel 1*/
    .long   SINC2_CH2_IRQHandler                            /* SINC Filter Glue 2 channel 2*/
    .long   SINC2_CH3_IRQHandler                            /* SINC Filter Glue 2 channel 3*/
    .long   GPIO4_0_IRQHandler                              /* GPIO4 interrupt 0*/
    .long   GPIO4_1_IRQHandler                              /* GPIO4 interrupt 1*/
    .long   GPIO5_0_IRQHandler                              /* GPIO5 interrupt 0*/
    .long   GPIO5_1_IRQHandler                              /* GPIO5 interrupt 1*/
    .long   GPIO6_0_IRQHandler                              /* GPIO6 interrupt 0*/
    .long   GPIO6_1_IRQHandler                              /* GPIO6 interrupt 1*/
    .long   ECAT_RST_OUT_IRQHandler                         /* ECAT reset out interrupt*/
    .long   0xFFFFFFFF                                      /*  Reserved for user TRIM value*/

    .size   __isr_vector, . - __isr_vector

    .text
    .thumb

/* Reset Handler */

    .thumb_func
    .align 2
    .globl   Reset_Handler
    .weak    Reset_Handler
    .type    Reset_Handler, %function
Reset_Handler:
    cpsid   i               /* Mask interrupts */
    .equ    VTOR, 0xE000ED08
    ldr     r0, =VTOR
    ldr     r1, =__isr_vector
    str     r1, [r0]
    ldr     r2, [r1]
    msr     msp, r2
#ifndef __NO_SYSTEM_INIT
    ldr   r0,=SystemInit
    blx   r0
#endif

#ifndef __RAM_BUILD
/*     Loop to copy data from read only memory to RAM. The ranges
 *      of copy from/to are specified by following symbols evaluated in
 *      linker script.
 *      __data_load__: begin of data sections to copy from.
 *      __data_start__/__data_end__: RAM address range that data should be
 *      __noncachedata_start__/__noncachedata_end__ : none cachable region
 *      copied to. Both must be aligned to 4 bytes boundary.  */

    ldr    r1, =__data_load__
    ldr    r2, =__data_start__
    ldr    r3, =__data_end__

#ifdef __PERFORMANCE_IMPLEMENTATION
/* Here are two copies of loop implementations. First one favors performance
 * and the second one favors code size. Default uses the second one.
 * Define macro "__PERFORMANCE_IMPLEMENTATION" in project to use the first one */
    subs    r3, r2
    ble    .LC1
.LC0:
    subs    r3, #4
    ldr    r0, [r1, r3]
    str    r0, [r2, r3]
    bgt    .LC0
.LC1:
#else  /* code size implemenation */
.LC0:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC0
#endif
#ifdef __STARTUP_INITIALIZE_NONCACHEDATA
    ldr    r2, =__noncachedata_start__
    ldr    r3, =__noncachedata_init_end__
#ifdef __PERFORMANCE_IMPLEMENTATION
/* Here are two copies of loop implementations. First one favors performance
 * and the second one favors code size. Default uses the second one.
 * Define macro "__PERFORMANCE_IMPLEMENTATION" in project to use the first one */
    subs    r3, r2
    ble    .LC3
.LC2:
    subs    r3, #4
    ldr    r0, [r1, r3]
    str    r0, [r2, r3]
    bgt    .LC2
.LC3:
#else  /* code size implemenation */
.LC2:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC2
#endif
/* zero inited ncache section initialization */
    ldr r3, =__noncachedata_end__
    movs    r0,0
.LC4:
    cmp    r2,r3
    itt    lt
    strlt   r0,[r2],#4
    blt    .LC4
#endif /* __STARTUP_INITIALIZE_NONCACHEDATA */

/* Copy text from flash to memory */
    ldr    r1, =__text_load
    ldr    r2, =__text_start
    ldr    r3, =__text_end

.LC5:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC5

/* Copy slow text from flash to memory */
    ldr    r1, =__slow_text_load
    ldr    r2, =__slow_text_start
    ldr    r3, =__slow_text_end

.LC6:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC6

/* Relocate vector table */
    ldr    r1, =__isr_vector
    ldr    r2, =__ram_isr_vector_start
    ldr    r3, =__ram_isr_vector_end

.LC7:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC7

/* Update VTOR offset register */
    .equ    VTOR, 0xE000ED08
    ldr     r0, =VTOR
    ldr     r1, =__ram_isr_vector_start
    str     r1, [r0]
#endif /* __RAM_BUILD */

#ifdef __STARTUP_CLEAR_BSS
/*     This part of work usually is done in C library startup code. Otherwise,
 *     define this macro to enable it in this startup.
 *
 *     Loop to zero out BSS section, which uses following symbols
 *     in linker script:
 *      __START_BSS: start of BSS section. Must align to 4
 *      __END_BSS: end of BSS section. Must align to 4
 */
    ldr r1, =__START_BSS
    ldr r2, =__END_BSS

    movs    r0, 0
.LC8:
    cmp     r1, r2
    itt    lt
    strlt   r0, [r1], #4
    blt    .LC8
#endif /* __STARTUP_CLEAR_BSS */

    ldr   r0,=BOARD_Init
    blx   r0

    cpsie   i               /* Unmask interrupts */
#ifndef __START
#define __START _start
#endif
#ifndef __ATOLLIC__
    ldr   r0,=__START
    blx   r0
#else
    ldr   r0,=__libc_init_array
    blx   r0
    ldr   r0,=main
    bx    r0
#endif
    .pool
    .size Reset_Handler, . - Reset_Handler

    .section .isr_handlers
    .align  1
    .thumb_func
    .weak DefaultISR
    .type DefaultISR, %function
DefaultISR:
    b DefaultISR
    .size DefaultISR, . - DefaultISR

    .align 1
    .thumb_func
    .weak NMI_Handler
    .type NMI_Handler, %function
NMI_Handler:
    ldr   r0,=NMI_Handler
    bx    r0
    .size NMI_Handler, . - NMI_Handler

    .align 1
    .thumb_func
    .weak HardFault_Handler
    .type HardFault_Handler, %function
HardFault_Handler:
    ldr   r0,=HardFault_Handler
    bx    r0
    .size HardFault_Handler, . - HardFault_Handler

    .align 1
    .thumb_func
    .weak SVC_Handler
    .type SVC_Handler, %function
SVC_Handler:
    ldr   r0,=SVC_Handler
    bx    r0
    .size SVC_Handler, . - SVC_Handler

    .align 1
    .thumb_func
    .weak PendSV_Handler
    .type PendSV_Handler, %function
PendSV_Handler:
    ldr   r0,=PendSV_Handler
    bx    r0
    .size PendSV_Handler, . - PendSV_Handler

    .align 1
    .thumb_func
    .weak SysTick_Handler
    .type SysTick_Handler, %function
SysTick_Handler:
    ldr   r0,=SysTick_Handler
    bx    r0
    .size SysTick_Handler, . - SysTick_Handler

    .align 1
    .thumb_func
    .weak CAN1_IRQHandler
    .type CAN1_IRQHandler, %function
CAN1_IRQHandler:
    ldr   r0,=CAN1_DriverIRQHandler
    bx    r0
    .size CAN1_IRQHandler, . - CAN1_IRQHandler

    .align 1
    .thumb_func
    .weak CAN1_ERROR_IRQHandler
    .type CAN1_ERROR_IRQHandler, %function
CAN1_ERROR_IRQHandler:
    ldr   r0,=CAN1_ERROR_DriverIRQHandler
    bx    r0
    .size CAN1_ERROR_IRQHandler, . - CAN1_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak I3C1_IRQHandler
    .type I3C1_IRQHandler, %function
I3C1_IRQHandler:
    ldr   r0,=I3C1_DriverIRQHandler
    bx    r0
    .size I3C1_IRQHandler, . - I3C1_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C1_IRQHandler
    .type LPI2C1_IRQHandler, %function
LPI2C1_IRQHandler:
    ldr   r0,=LPI2C1_DriverIRQHandler
    bx    r0
    .size LPI2C1_IRQHandler, . - LPI2C1_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C2_IRQHandler
    .type LPI2C2_IRQHandler, %function
LPI2C2_IRQHandler:
    ldr   r0,=LPI2C2_DriverIRQHandler
    bx    r0
    .size LPI2C2_IRQHandler, . - LPI2C2_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI1_IRQHandler
    .type LPSPI1_IRQHandler, %function
LPSPI1_IRQHandler:
    ldr   r0,=LPSPI1_DriverIRQHandler
    bx    r0
    .size LPSPI1_IRQHandler, . - LPSPI1_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI2_IRQHandler
    .type LPSPI2_IRQHandler, %function
LPSPI2_IRQHandler:
    ldr   r0,=LPSPI2_DriverIRQHandler
    bx    r0
    .size LPSPI2_IRQHandler, . - LPSPI2_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART1_IRQHandler
    .type LPUART1_IRQHandler, %function
LPUART1_IRQHandler:
    ldr   r0,=LPUART1_DriverIRQHandler
    bx    r0
    .size LPUART1_IRQHandler, . - LPUART1_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART2_IRQHandler
    .type LPUART2_IRQHandler, %function
LPUART2_IRQHandler:
    ldr   r0,=LPUART2_DriverIRQHandler
    bx    r0
    .size LPUART2_IRQHandler, . - LPUART2_IRQHandler

    .align 1
    .thumb_func
    .weak PDM_HWVAD_EVENT_IRQHandler
    .type PDM_HWVAD_EVENT_IRQHandler, %function
PDM_HWVAD_EVENT_IRQHandler:
    ldr   r0,=PDM_HWVAD_EVENT_DriverIRQHandler
    bx    r0
    .size PDM_HWVAD_EVENT_IRQHandler, . - PDM_HWVAD_EVENT_IRQHandler

    .align 1
    .thumb_func
    .weak PDM_HWVAD_ERROR_IRQHandler
    .type PDM_HWVAD_ERROR_IRQHandler, %function
PDM_HWVAD_ERROR_IRQHandler:
    ldr   r0,=PDM_HWVAD_ERROR_DriverIRQHandler
    bx    r0
    .size PDM_HWVAD_ERROR_IRQHandler, . - PDM_HWVAD_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak PDM_EVENT_IRQHandler
    .type PDM_EVENT_IRQHandler, %function
PDM_EVENT_IRQHandler:
    ldr   r0,=PDM_EVENT_DriverIRQHandler
    bx    r0
    .size PDM_EVENT_IRQHandler, . - PDM_EVENT_IRQHandler

    .align 1
    .thumb_func
    .weak PDM_ERROR_IRQHandler
    .type PDM_ERROR_IRQHandler, %function
PDM_ERROR_IRQHandler:
    ldr   r0,=PDM_ERROR_DriverIRQHandler
    bx    r0
    .size PDM_ERROR_IRQHandler, . - PDM_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak SAI1_IRQHandler
    .type SAI1_IRQHandler, %function
SAI1_IRQHandler:
    ldr   r0,=SAI1_DriverIRQHandler
    bx    r0
    .size SAI1_IRQHandler, . - SAI1_IRQHandler

    .align 1
    .thumb_func
    .weak CAN2_IRQHandler
    .type CAN2_IRQHandler, %function
CAN2_IRQHandler:
    ldr   r0,=CAN2_DriverIRQHandler
    bx    r0
    .size CAN2_IRQHandler, . - CAN2_IRQHandler

    .align 1
    .thumb_func
    .weak CAN2_ERROR_IRQHandler
    .type CAN2_ERROR_IRQHandler, %function
CAN2_ERROR_IRQHandler:
    ldr   r0,=CAN2_ERROR_DriverIRQHandler
    bx    r0
    .size CAN2_ERROR_IRQHandler, . - CAN2_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak FLEXIO1_IRQHandler
    .type FLEXIO1_IRQHandler, %function
FLEXIO1_IRQHandler:
    ldr   r0,=FLEXIO1_DriverIRQHandler
    bx    r0
    .size FLEXIO1_IRQHandler, . - FLEXIO1_IRQHandler

    .align 1
    .thumb_func
    .weak FLEXIO2_IRQHandler
    .type FLEXIO2_IRQHandler, %function
FLEXIO2_IRQHandler:
    ldr   r0,=FLEXIO2_DriverIRQHandler
    bx    r0
    .size FLEXIO2_IRQHandler, . - FLEXIO2_IRQHandler

    .align 1
    .thumb_func
    .weak FLEXSPI1_IRQHandler
    .type FLEXSPI1_IRQHandler, %function
FLEXSPI1_IRQHandler:
    ldr   r0,=FLEXSPI1_DriverIRQHandler
    bx    r0
    .size FLEXSPI1_IRQHandler, . - FLEXSPI1_IRQHandler

    .align 1
    .thumb_func
    .weak FLEXSPI2_IRQHandler
    .type FLEXSPI2_IRQHandler, %function
FLEXSPI2_IRQHandler:
    ldr   r0,=FLEXSPI2_DriverIRQHandler
    bx    r0
    .size FLEXSPI2_IRQHandler, . - FLEXSPI2_IRQHandler

    .align 1
    .thumb_func
    .weak I3C2_IRQHandler
    .type I3C2_IRQHandler, %function
I3C2_IRQHandler:
    ldr   r0,=I3C2_DriverIRQHandler
    bx    r0
    .size I3C2_IRQHandler, . - I3C2_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C3_IRQHandler
    .type LPI2C3_IRQHandler, %function
LPI2C3_IRQHandler:
    ldr   r0,=LPI2C3_DriverIRQHandler
    bx    r0
    .size LPI2C3_IRQHandler, . - LPI2C3_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C4_IRQHandler
    .type LPI2C4_IRQHandler, %function
LPI2C4_IRQHandler:
    ldr   r0,=LPI2C4_DriverIRQHandler
    bx    r0
    .size LPI2C4_IRQHandler, . - LPI2C4_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI3_IRQHandler
    .type LPSPI3_IRQHandler, %function
LPSPI3_IRQHandler:
    ldr   r0,=LPSPI3_DriverIRQHandler
    bx    r0
    .size LPSPI3_IRQHandler, . - LPSPI3_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI4_IRQHandler
    .type LPSPI4_IRQHandler, %function
LPSPI4_IRQHandler:
    ldr   r0,=LPSPI4_DriverIRQHandler
    bx    r0
    .size LPSPI4_IRQHandler, . - LPSPI4_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART3_IRQHandler
    .type LPUART3_IRQHandler, %function
LPUART3_IRQHandler:
    ldr   r0,=LPUART3_DriverIRQHandler
    bx    r0
    .size LPUART3_IRQHandler, . - LPUART3_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART4_IRQHandler
    .type LPUART4_IRQHandler, %function
LPUART4_IRQHandler:
    ldr   r0,=LPUART4_DriverIRQHandler
    bx    r0
    .size LPUART4_IRQHandler, . - LPUART4_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART5_IRQHandler
    .type LPUART5_IRQHandler, %function
LPUART5_IRQHandler:
    ldr   r0,=LPUART5_DriverIRQHandler
    bx    r0
    .size LPUART5_IRQHandler, . - LPUART5_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART6_IRQHandler
    .type LPUART6_IRQHandler, %function
LPUART6_IRQHandler:
    ldr   r0,=LPUART6_DriverIRQHandler
    bx    r0
    .size LPUART6_IRQHandler, . - LPUART6_IRQHandler

    .align 1
    .thumb_func
    .weak ASRC_IRQHandler
    .type ASRC_IRQHandler, %function
ASRC_IRQHandler:
    ldr   r0,=ASRC_DriverIRQHandler
    bx    r0
    .size ASRC_IRQHandler, . - ASRC_IRQHandler

    .align 1
    .thumb_func
    .weak USDHC1_IRQHandler
    .type USDHC1_IRQHandler, %function
USDHC1_IRQHandler:
    ldr   r0,=USDHC1_DriverIRQHandler
    bx    r0
    .size USDHC1_IRQHandler, . - USDHC1_IRQHandler

    .align 1
    .thumb_func
    .weak USDHC2_IRQHandler
    .type USDHC2_IRQHandler, %function
USDHC2_IRQHandler:
    ldr   r0,=USDHC2_DriverIRQHandler
    bx    r0
    .size USDHC2_IRQHandler, . - USDHC2_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_ERROR_IRQHandler
    .type DMA_ERROR_IRQHandler, %function
DMA_ERROR_IRQHandler:
    ldr   r0,=DMA_ERROR_DriverIRQHandler
    bx    r0
    .size DMA_ERROR_IRQHandler, . - DMA_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH0_IRQHandler
    .type DMA3_CH0_IRQHandler, %function
DMA3_CH0_IRQHandler:
    ldr   r0,=DMA3_CH0_DriverIRQHandler
    bx    r0
    .size DMA3_CH0_IRQHandler, . - DMA3_CH0_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH1_IRQHandler
    .type DMA3_CH1_IRQHandler, %function
DMA3_CH1_IRQHandler:
    ldr   r0,=DMA3_CH1_DriverIRQHandler
    bx    r0
    .size DMA3_CH1_IRQHandler, . - DMA3_CH1_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH2_IRQHandler
    .type DMA3_CH2_IRQHandler, %function
DMA3_CH2_IRQHandler:
    ldr   r0,=DMA3_CH2_DriverIRQHandler
    bx    r0
    .size DMA3_CH2_IRQHandler, . - DMA3_CH2_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH3_IRQHandler
    .type DMA3_CH3_IRQHandler, %function
DMA3_CH3_IRQHandler:
    ldr   r0,=DMA3_CH3_DriverIRQHandler
    bx    r0
    .size DMA3_CH3_IRQHandler, . - DMA3_CH3_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH4_IRQHandler
    .type DMA3_CH4_IRQHandler, %function
DMA3_CH4_IRQHandler:
    ldr   r0,=DMA3_CH4_DriverIRQHandler
    bx    r0
    .size DMA3_CH4_IRQHandler, . - DMA3_CH4_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH5_IRQHandler
    .type DMA3_CH5_IRQHandler, %function
DMA3_CH5_IRQHandler:
    ldr   r0,=DMA3_CH5_DriverIRQHandler
    bx    r0
    .size DMA3_CH5_IRQHandler, . - DMA3_CH5_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH6_IRQHandler
    .type DMA3_CH6_IRQHandler, %function
DMA3_CH6_IRQHandler:
    ldr   r0,=DMA3_CH6_DriverIRQHandler
    bx    r0
    .size DMA3_CH6_IRQHandler, . - DMA3_CH6_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH7_IRQHandler
    .type DMA3_CH7_IRQHandler, %function
DMA3_CH7_IRQHandler:
    ldr   r0,=DMA3_CH7_DriverIRQHandler
    bx    r0
    .size DMA3_CH7_IRQHandler, . - DMA3_CH7_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH8_IRQHandler
    .type DMA3_CH8_IRQHandler, %function
DMA3_CH8_IRQHandler:
    ldr   r0,=DMA3_CH8_DriverIRQHandler
    bx    r0
    .size DMA3_CH8_IRQHandler, . - DMA3_CH8_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH9_IRQHandler
    .type DMA3_CH9_IRQHandler, %function
DMA3_CH9_IRQHandler:
    ldr   r0,=DMA3_CH9_DriverIRQHandler
    bx    r0
    .size DMA3_CH9_IRQHandler, . - DMA3_CH9_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH10_IRQHandler
    .type DMA3_CH10_IRQHandler, %function
DMA3_CH10_IRQHandler:
    ldr   r0,=DMA3_CH10_DriverIRQHandler
    bx    r0
    .size DMA3_CH10_IRQHandler, . - DMA3_CH10_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH11_IRQHandler
    .type DMA3_CH11_IRQHandler, %function
DMA3_CH11_IRQHandler:
    ldr   r0,=DMA3_CH11_DriverIRQHandler
    bx    r0
    .size DMA3_CH11_IRQHandler, . - DMA3_CH11_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH12_IRQHandler
    .type DMA3_CH12_IRQHandler, %function
DMA3_CH12_IRQHandler:
    ldr   r0,=DMA3_CH12_DriverIRQHandler
    bx    r0
    .size DMA3_CH12_IRQHandler, . - DMA3_CH12_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH13_IRQHandler
    .type DMA3_CH13_IRQHandler, %function
DMA3_CH13_IRQHandler:
    ldr   r0,=DMA3_CH13_DriverIRQHandler
    bx    r0
    .size DMA3_CH13_IRQHandler, . - DMA3_CH13_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH14_IRQHandler
    .type DMA3_CH14_IRQHandler, %function
DMA3_CH14_IRQHandler:
    ldr   r0,=DMA3_CH14_DriverIRQHandler
    bx    r0
    .size DMA3_CH14_IRQHandler, . - DMA3_CH14_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH15_IRQHandler
    .type DMA3_CH15_IRQHandler, %function
DMA3_CH15_IRQHandler:
    ldr   r0,=DMA3_CH15_DriverIRQHandler
    bx    r0
    .size DMA3_CH15_IRQHandler, . - DMA3_CH15_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH16_IRQHandler
    .type DMA3_CH16_IRQHandler, %function
DMA3_CH16_IRQHandler:
    ldr   r0,=DMA3_CH16_DriverIRQHandler
    bx    r0
    .size DMA3_CH16_IRQHandler, . - DMA3_CH16_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH17_IRQHandler
    .type DMA3_CH17_IRQHandler, %function
DMA3_CH17_IRQHandler:
    ldr   r0,=DMA3_CH17_DriverIRQHandler
    bx    r0
    .size DMA3_CH17_IRQHandler, . - DMA3_CH17_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH18_IRQHandler
    .type DMA3_CH18_IRQHandler, %function
DMA3_CH18_IRQHandler:
    ldr   r0,=DMA3_CH18_DriverIRQHandler
    bx    r0
    .size DMA3_CH18_IRQHandler, . - DMA3_CH18_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH19_IRQHandler
    .type DMA3_CH19_IRQHandler, %function
DMA3_CH19_IRQHandler:
    ldr   r0,=DMA3_CH19_DriverIRQHandler
    bx    r0
    .size DMA3_CH19_IRQHandler, . - DMA3_CH19_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH20_IRQHandler
    .type DMA3_CH20_IRQHandler, %function
DMA3_CH20_IRQHandler:
    ldr   r0,=DMA3_CH20_DriverIRQHandler
    bx    r0
    .size DMA3_CH20_IRQHandler, . - DMA3_CH20_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH21_IRQHandler
    .type DMA3_CH21_IRQHandler, %function
DMA3_CH21_IRQHandler:
    ldr   r0,=DMA3_CH21_DriverIRQHandler
    bx    r0
    .size DMA3_CH21_IRQHandler, . - DMA3_CH21_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH22_IRQHandler
    .type DMA3_CH22_IRQHandler, %function
DMA3_CH22_IRQHandler:
    ldr   r0,=DMA3_CH22_DriverIRQHandler
    bx    r0
    .size DMA3_CH22_IRQHandler, . - DMA3_CH22_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH23_IRQHandler
    .type DMA3_CH23_IRQHandler, %function
DMA3_CH23_IRQHandler:
    ldr   r0,=DMA3_CH23_DriverIRQHandler
    bx    r0
    .size DMA3_CH23_IRQHandler, . - DMA3_CH23_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH24_IRQHandler
    .type DMA3_CH24_IRQHandler, %function
DMA3_CH24_IRQHandler:
    ldr   r0,=DMA3_CH24_DriverIRQHandler
    bx    r0
    .size DMA3_CH24_IRQHandler, . - DMA3_CH24_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH25_IRQHandler
    .type DMA3_CH25_IRQHandler, %function
DMA3_CH25_IRQHandler:
    ldr   r0,=DMA3_CH25_DriverIRQHandler
    bx    r0
    .size DMA3_CH25_IRQHandler, . - DMA3_CH25_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH26_IRQHandler
    .type DMA3_CH26_IRQHandler, %function
DMA3_CH26_IRQHandler:
    ldr   r0,=DMA3_CH26_DriverIRQHandler
    bx    r0
    .size DMA3_CH26_IRQHandler, . - DMA3_CH26_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH27_IRQHandler
    .type DMA3_CH27_IRQHandler, %function
DMA3_CH27_IRQHandler:
    ldr   r0,=DMA3_CH27_DriverIRQHandler
    bx    r0
    .size DMA3_CH27_IRQHandler, . - DMA3_CH27_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH28_SINC3_CH0_IRQHandler
    .type DMA3_CH28_SINC3_CH0_IRQHandler, %function
DMA3_CH28_SINC3_CH0_IRQHandler:
    ldr   r0,=DMA3_CH28_SINC3_CH0_DriverIRQHandler
    bx    r0
    .size DMA3_CH28_SINC3_CH0_IRQHandler, . - DMA3_CH28_SINC3_CH0_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH29_SINC3_CH1_IRQHandler
    .type DMA3_CH29_SINC3_CH1_IRQHandler, %function
DMA3_CH29_SINC3_CH1_IRQHandler:
    ldr   r0,=DMA3_CH29_SINC3_CH1_DriverIRQHandler
    bx    r0
    .size DMA3_CH29_SINC3_CH1_IRQHandler, . - DMA3_CH29_SINC3_CH1_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH30_SINC3_CH2_IRQHandler
    .type DMA3_CH30_SINC3_CH2_IRQHandler, %function
DMA3_CH30_SINC3_CH2_IRQHandler:
    ldr   r0,=DMA3_CH30_SINC3_CH2_DriverIRQHandler
    bx    r0
    .size DMA3_CH30_SINC3_CH2_IRQHandler, . - DMA3_CH30_SINC3_CH2_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH31_SINC3_CH3_IRQHandler
    .type DMA3_CH31_SINC3_CH3_IRQHandler, %function
DMA3_CH31_SINC3_CH3_IRQHandler:
    ldr   r0,=DMA3_CH31_SINC3_CH3_DriverIRQHandler
    bx    r0
    .size DMA3_CH31_SINC3_CH3_IRQHandler, . - DMA3_CH31_SINC3_CH3_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_ERROR_IRQHandler
    .type DMA4_ERROR_IRQHandler, %function
DMA4_ERROR_IRQHandler:
    ldr   r0,=DMA4_ERROR_DriverIRQHandler
    bx    r0
    .size DMA4_ERROR_IRQHandler, . - DMA4_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH0_CH1_IRQHandler
    .type DMA4_CH0_CH1_IRQHandler, %function
DMA4_CH0_CH1_IRQHandler:
    ldr   r0,=DMA4_CH0_CH1_DriverIRQHandler
    bx    r0
    .size DMA4_CH0_CH1_IRQHandler, . - DMA4_CH0_CH1_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH2_CH3_IRQHandler
    .type DMA4_CH2_CH3_IRQHandler, %function
DMA4_CH2_CH3_IRQHandler:
    ldr   r0,=DMA4_CH2_CH3_DriverIRQHandler
    bx    r0
    .size DMA4_CH2_CH3_IRQHandler, . - DMA4_CH2_CH3_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH4_CH5_IRQHandler
    .type DMA4_CH4_CH5_IRQHandler, %function
DMA4_CH4_CH5_IRQHandler:
    ldr   r0,=DMA4_CH4_CH5_DriverIRQHandler
    bx    r0
    .size DMA4_CH4_CH5_IRQHandler, . - DMA4_CH4_CH5_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH6_CH7_IRQHandler
    .type DMA4_CH6_CH7_IRQHandler, %function
DMA4_CH6_CH7_IRQHandler:
    ldr   r0,=DMA4_CH6_CH7_DriverIRQHandler
    bx    r0
    .size DMA4_CH6_CH7_IRQHandler, . - DMA4_CH6_CH7_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH8_CH9_IRQHandler
    .type DMA4_CH8_CH9_IRQHandler, %function
DMA4_CH8_CH9_IRQHandler:
    ldr   r0,=DMA4_CH8_CH9_DriverIRQHandler
    bx    r0
    .size DMA4_CH8_CH9_IRQHandler, . - DMA4_CH8_CH9_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH10_CH11_IRQHandler
    .type DMA4_CH10_CH11_IRQHandler, %function
DMA4_CH10_CH11_IRQHandler:
    ldr   r0,=DMA4_CH10_CH11_DriverIRQHandler
    bx    r0
    .size DMA4_CH10_CH11_IRQHandler, . - DMA4_CH10_CH11_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH12_CH13_IRQHandler
    .type DMA4_CH12_CH13_IRQHandler, %function
DMA4_CH12_CH13_IRQHandler:
    ldr   r0,=DMA4_CH12_CH13_DriverIRQHandler
    bx    r0
    .size DMA4_CH12_CH13_IRQHandler, . - DMA4_CH12_CH13_IRQHandler

