NXP/GenAVB_TSN-rtos-apps/devices/MIMXRT118x/common/cm7/armgcc/startup_MIMXRT118x_cm7.S
    .align 1
    .thumb_func
    .weak DMA4_CH14_CH15_IRQHandler
    .type DMA4_CH14_CH15_IRQHandler, %function
DMA4_CH14_CH15_IRQHandler:
    ldr   r0,=DMA4_CH14_CH15_DriverIRQHandler
    bx    r0
    .size DMA4_CH14_CH15_IRQHandler, . - DMA4_CH14_CH15_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH16_CH17_IRQHandler
    .type DMA4_CH16_CH17_IRQHandler, %function
DMA4_CH16_CH17_IRQHandler:
    ldr   r0,=DMA4_CH16_CH17_DriverIRQHandler
    bx    r0
    .size DMA4_CH16_CH17_IRQHandler, . - DMA4_CH16_CH17_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH18_CH19_IRQHandler
    .type DMA4_CH18_CH19_IRQHandler, %function
DMA4_CH18_CH19_IRQHandler:
    ldr   r0,=DMA4_CH18_CH19_DriverIRQHandler
    bx    r0
    .size DMA4_CH18_CH19_IRQHandler, . - DMA4_CH18_CH19_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH20_CH21_IRQHandler
    .type DMA4_CH20_CH21_IRQHandler, %function
DMA4_CH20_CH21_IRQHandler:
    ldr   r0,=DMA4_CH20_CH21_DriverIRQHandler
    bx    r0
    .size DMA4_CH20_CH21_IRQHandler, . - DMA4_CH20_CH21_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH22_CH23_IRQHandler
    .type DMA4_CH22_CH23_IRQHandler, %function
DMA4_CH22_CH23_IRQHandler:
    ldr   r0,=DMA4_CH22_CH23_DriverIRQHandler
    bx    r0
    .size DMA4_CH22_CH23_IRQHandler, . - DMA4_CH22_CH23_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH24_CH25_IRQHandler
    .type DMA4_CH24_CH25_IRQHandler, %function
DMA4_CH24_CH25_IRQHandler:
    ldr   r0,=DMA4_CH24_CH25_DriverIRQHandler
    bx    r0
    .size DMA4_CH24_CH25_IRQHandler, . - DMA4_CH24_CH25_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH26_CH27_IRQHandler
    .type DMA4_CH26_CH27_IRQHandler, %function
DMA4_CH26_CH27_IRQHandler:
    ldr   r0,=DMA4_CH26_CH27_DriverIRQHandler
    bx    r0
    .size DMA4_CH26_CH27_IRQHandler, . - DMA4_CH26_CH27_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH28_CH29_IRQHandler
    .type DMA4_CH28_CH29_IRQHandler, %function
DMA4_CH28_CH29_IRQHandler:
    ldr   r0,=DMA4_CH28_CH29_DriverIRQHandler
    bx    r0
    .size DMA4_CH28_CH29_IRQHandler, . - DMA4_CH28_CH29_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH30_CH31_IRQHandler
    .type DMA4_CH30_CH31_IRQHandler, %function
DMA4_CH30_CH31_IRQHandler:
    ldr   r0,=DMA4_CH30_CH31_DriverIRQHandler
    bx    r0
    .size DMA4_CH30_CH31_IRQHandler, . - DMA4_CH30_CH31_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH32_CH33_IRQHandler
    .type DMA4_CH32_CH33_IRQHandler, %function
DMA4_CH32_CH33_IRQHandler:
    ldr   r0,=DMA4_CH32_CH33_DriverIRQHandler
    bx    r0
    .size DMA4_CH32_CH33_IRQHandler, . - DMA4_CH32_CH33_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH34_CH35_IRQHandler
    .type DMA4_CH34_CH35_IRQHandler, %function
DMA4_CH34_CH35_IRQHandler:
    ldr   r0,=DMA4_CH34_CH35_DriverIRQHandler
    bx    r0
    .size DMA4_CH34_CH35_IRQHandler, . - DMA4_CH34_CH35_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH36_CH37_IRQHandler
    .type DMA4_CH36_CH37_IRQHandler, %function
DMA4_CH36_CH37_IRQHandler:
    ldr   r0,=DMA4_CH36_CH37_DriverIRQHandler
    bx    r0
    .size DMA4_CH36_CH37_IRQHandler, . - DMA4_CH36_CH37_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH38_CH39_IRQHandler
    .type DMA4_CH38_CH39_IRQHandler, %function
DMA4_CH38_CH39_IRQHandler:
    ldr   r0,=DMA4_CH38_CH39_DriverIRQHandler
    bx    r0
    .size DMA4_CH38_CH39_IRQHandler, . - DMA4_CH38_CH39_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH40_CH41_IRQHandler
    .type DMA4_CH40_CH41_IRQHandler, %function
DMA4_CH40_CH41_IRQHandler:
    ldr   r0,=DMA4_CH40_CH41_DriverIRQHandler
    bx    r0
    .size DMA4_CH40_CH41_IRQHandler, . - DMA4_CH40_CH41_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH42_CH43_IRQHandler
    .type DMA4_CH42_CH43_IRQHandler, %function
DMA4_CH42_CH43_IRQHandler:
    ldr   r0,=DMA4_CH42_CH43_DriverIRQHandler
    bx    r0
    .size DMA4_CH42_CH43_IRQHandler, . - DMA4_CH42_CH43_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH44_CH45_IRQHandler
    .type DMA4_CH44_CH45_IRQHandler, %function
DMA4_CH44_CH45_IRQHandler:
    ldr   r0,=DMA4_CH44_CH45_DriverIRQHandler
    bx    r0
    .size DMA4_CH44_CH45_IRQHandler, . - DMA4_CH44_CH45_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH46_CH47_IRQHandler
    .type DMA4_CH46_CH47_IRQHandler, %function
DMA4_CH46_CH47_IRQHandler:
    ldr   r0,=DMA4_CH46_CH47_DriverIRQHandler
    bx    r0
    .size DMA4_CH46_CH47_IRQHandler, . - DMA4_CH46_CH47_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH48_CH49_LPI2C5_IRQHandler
    .type DMA4_CH48_CH49_LPI2C5_IRQHandler, %function
DMA4_CH48_CH49_LPI2C5_IRQHandler:
    ldr   r0,=DMA4_CH48_CH49_LPI2C5_DriverIRQHandler
    bx    r0
    .size DMA4_CH48_CH49_LPI2C5_IRQHandler, . - DMA4_CH48_CH49_LPI2C5_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH50_CH51_LPI2C6_IRQHandler
    .type DMA4_CH50_CH51_LPI2C6_IRQHandler, %function
DMA4_CH50_CH51_LPI2C6_IRQHandler:
    ldr   r0,=DMA4_CH50_CH51_LPI2C6_DriverIRQHandler
    bx    r0
    .size DMA4_CH50_CH51_LPI2C6_IRQHandler, . - DMA4_CH50_CH51_LPI2C6_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH52_CH53_SAI4_IRQHandler
    .type DMA4_CH52_CH53_SAI4_IRQHandler, %function
DMA4_CH52_CH53_SAI4_IRQHandler:
    ldr   r0,=DMA4_CH52_CH53_SAI4_DriverIRQHandler
    bx    r0
    .size DMA4_CH52_CH53_SAI4_IRQHandler, . - DMA4_CH52_CH53_SAI4_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH54_CH55_SPDIF_IRQHandler
    .type DMA4_CH54_CH55_SPDIF_IRQHandler, %function
DMA4_CH54_CH55_SPDIF_IRQHandler:
    ldr   r0,=DMA4_CH54_CH55_SPDIF_DriverIRQHandler
    bx    r0
    .size DMA4_CH54_CH55_SPDIF_IRQHandler, . - DMA4_CH54_CH55_SPDIF_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH56_CH57_LPUART9_IRQHandler
    .type DMA4_CH56_CH57_LPUART9_IRQHandler, %function
DMA4_CH56_CH57_LPUART9_IRQHandler:
    ldr   r0,=DMA4_CH56_CH57_LPUART9_DriverIRQHandler
    bx    r0
    .size DMA4_CH56_CH57_LPUART9_IRQHandler, . - DMA4_CH56_CH57_LPUART9_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH58_CH59_LPUART10_IRQHandler
    .type DMA4_CH58_CH59_LPUART10_IRQHandler, %function
DMA4_CH58_CH59_LPUART10_IRQHandler:
    ldr   r0,=DMA4_CH58_CH59_LPUART10_DriverIRQHandler
    bx    r0
    .size DMA4_CH58_CH59_LPUART10_IRQHandler, . - DMA4_CH58_CH59_LPUART10_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH60_CH61_LPUART11_IRQHandler
    .type DMA4_CH60_CH61_LPUART11_IRQHandler, %function
DMA4_CH60_CH61_LPUART11_IRQHandler:
    ldr   r0,=DMA4_CH60_CH61_LPUART11_DriverIRQHandler
    bx    r0
    .size DMA4_CH60_CH61_LPUART11_IRQHandler, . - DMA4_CH60_CH61_LPUART11_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART12_IRQHandler
    .type LPUART12_IRQHandler, %function
LPUART12_IRQHandler:
    ldr   r0,=LPUART12_DriverIRQHandler
    bx    r0
    .size LPUART12_IRQHandler, . - LPUART12_IRQHandler

    .align 1
    .thumb_func
    .weak CAN3_IRQHandler
    .type CAN3_IRQHandler, %function
CAN3_IRQHandler:
    ldr   r0,=CAN3_DriverIRQHandler
    bx    r0
    .size CAN3_IRQHandler, . - CAN3_IRQHandler

    .align 1
    .thumb_func
    .weak CAN3_ERROR_IRQHandler
    .type CAN3_ERROR_IRQHandler, %function
CAN3_ERROR_IRQHandler:
    ldr   r0,=CAN3_ERROR_DriverIRQHandler
    bx    r0
    .size CAN3_ERROR_IRQHandler, . - CAN3_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI5_IRQHandler
    .type LPSPI5_IRQHandler, %function
LPSPI5_IRQHandler:
    ldr   r0,=LPSPI5_DriverIRQHandler
    bx    r0
    .size LPSPI5_IRQHandler, . - LPSPI5_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI6_IRQHandler
    .type LPSPI6_IRQHandler, %function
LPSPI6_IRQHandler:
    ldr   r0,=LPSPI6_DriverIRQHandler
    bx    r0
    .size LPSPI6_IRQHandler, . - LPSPI6_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART7_IRQHandler
    .type LPUART7_IRQHandler, %function
LPUART7_IRQHandler:
    ldr   r0,=LPUART7_DriverIRQHandler
    bx    r0
    .size LPUART7_IRQHandler, . - LPUART7_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART8_IRQHandler
    .type LPUART8_IRQHandler, %function
LPUART8_IRQHandler:
    ldr   r0,=LPUART8_DriverIRQHandler
    bx    r0
    .size LPUART8_IRQHandler, . - LPUART8_IRQHandler

    .align 1
    .thumb_func
    .weak SAI2_IRQHandler
    .type SAI2_IRQHandler, %function
SAI2_IRQHandler:
    ldr   r0,=SAI2_DriverIRQHandler
    bx    r0
    .size SAI2_IRQHandler, . - SAI2_IRQHandler

    .align 1
    .thumb_func
    .weak SAI3_IRQHandler
    .type SAI3_IRQHandler, %function
SAI3_IRQHandler:
    ldr   r0,=SAI3_DriverIRQHandler
    bx    r0
    .size SAI3_IRQHandler, . - SAI3_IRQHandler

    .align 1
    .thumb_func
    .weak FLEXSPI_SLV_IRQHandler
    .type FLEXSPI_SLV_IRQHandler, %function
FLEXSPI_SLV_IRQHandler:
    ldr   r0,=FLEXSPI_SLV_DriverIRQHandler
    bx    r0
    .size FLEXSPI_SLV_IRQHandler, . - FLEXSPI_SLV_IRQHandler


