NXP/GenAVB_TSN-rtos-apps/devices/MIMXRT118x/common/cm7/armgcc/startup_MIMXRT118x_cm7.S
/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
    .macro def_irq_handler  handler_name
    .weak \handler_name
    .set  \handler_name, DefaultISR
    .endm
/* Exception Handlers */
    def_irq_handler    MemManage_Handler
    def_irq_handler    BusFault_Handler
    def_irq_handler    UsageFault_Handler
    def_irq_handler    DebugMon_Handler
    def_irq_handler    TMR1_IRQHandler
    def_irq_handler    DAP_IRQHandler
    def_irq_handler    M7_CTI_TRIGGER_OUTPUT_IRQHandler
    def_irq_handler    M33_CTI_TRIGGER_OUTPUT_IRQHandler
    def_irq_handler    TMR5_IRQHandler
    def_irq_handler    TMR6_IRQHandler
    def_irq_handler    TMR7_IRQHandler
    def_irq_handler    TMR8_IRQHandler
    def_irq_handler    CAN1_DriverIRQHandler
    def_irq_handler    CAN1_ERROR_DriverIRQHandler
    def_irq_handler    GPIO1_0_IRQHandler
    def_irq_handler    GPIO1_1_IRQHandler
    def_irq_handler    I3C1_DriverIRQHandler
    def_irq_handler    LPI2C1_DriverIRQHandler
    def_irq_handler    LPI2C2_DriverIRQHandler
    def_irq_handler    LPIT1_IRQHandler
    def_irq_handler    LPSPI1_DriverIRQHandler
    def_irq_handler    LPSPI2_DriverIRQHandler
    def_irq_handler    LPTMR1_IRQHandler
    def_irq_handler    LPUART1_DriverIRQHandler
    def_irq_handler    LPUART2_DriverIRQHandler
    def_irq_handler    MU1_IRQHandler
    def_irq_handler    MU2_IRQHandler
    def_irq_handler    PWM1_FAULT_IRQHandler
    def_irq_handler    PWM1_0_IRQHandler
    def_irq_handler    PWM1_1_IRQHandler
    def_irq_handler    PWM1_2_IRQHandler
    def_irq_handler    PWM1_3_IRQHandler
    def_irq_handler    EDGELOCK_TRUST_MUA_RX_FULL_IRQHandler
    def_irq_handler    EDGELOCK_TRUST_MUA_TX_EMPTY_IRQHandler
    def_irq_handler    EDGELOCK_APPS_CORE_MUA_RX_FULL_IRQHandler
    def_irq_handler    EDGELOCK_APPS_CORE_MUA_TX_EMPTY_IRQHandler
    def_irq_handler    EDGELOCK_REALTIME_CORE_MUA_RX_FULL_IRQHandler
    def_irq_handler    EDGELOCK_REALTIME_CORE_MUA_TX_EMPTY_IRQHandler
    def_irq_handler    EDGELOCK_SECURE_IRQHandler
    def_irq_handler    EDGELOCK_NONSECURE_IRQHandler
    def_irq_handler    TPM1_XBAR1_CH0_CH1_IRQHandler
    def_irq_handler    TPM2_XBAR1_CH2_CH3_IRQHandler
    def_irq_handler    RTWDOG1_IRQHandler
    def_irq_handler    RTWDOG2_IRQHandler
    def_irq_handler    TRDC_MGR_AON_IRQHandler
    def_irq_handler    PDM_HWVAD_EVENT_DriverIRQHandler
    def_irq_handler    PDM_HWVAD_ERROR_DriverIRQHandler
    def_irq_handler    PDM_EVENT_DriverIRQHandler
    def_irq_handler    PDM_ERROR_DriverIRQHandler
    def_irq_handler    SAI1_DriverIRQHandler
    def_irq_handler    CM33_PS_IRQHandler
    def_irq_handler    CM33_TCM_ECC_IRQHandler
    def_irq_handler    CM33_TCM_ERROR_IRQHandler
    def_irq_handler    CM7_TCM_ECC_IRQHandler
    def_irq_handler    CM7_TCM_ERROR_IRQHandler
    def_irq_handler    CAN2_DriverIRQHandler
    def_irq_handler    CAN2_ERROR_DriverIRQHandler
    def_irq_handler    FLEXIO1_DriverIRQHandler
    def_irq_handler    FLEXIO2_DriverIRQHandler
    def_irq_handler    FLEXSPI1_DriverIRQHandler
    def_irq_handler    FLEXSPI2_DriverIRQHandler
    def_irq_handler    GPIO2_0_IRQHandler
    def_irq_handler    GPIO2_1_IRQHandler
    def_irq_handler    GPIO3_0_IRQHandler
    def_irq_handler    GPIO3_1_IRQHandler
    def_irq_handler    I3C2_DriverIRQHandler
    def_irq_handler    LPI2C3_DriverIRQHandler
    def_irq_handler    LPI2C4_DriverIRQHandler
    def_irq_handler    LPIT2_IRQHandler
    def_irq_handler    LPSPI3_DriverIRQHandler
    def_irq_handler    LPSPI4_DriverIRQHandler
    def_irq_handler    LPTMR2_IRQHandler
    def_irq_handler    LPUART3_DriverIRQHandler
    def_irq_handler    LPUART4_DriverIRQHandler
    def_irq_handler    LPUART5_DriverIRQHandler
    def_irq_handler    LPUART6_DriverIRQHandler
    def_irq_handler    ASRC_DriverIRQHandler
    def_irq_handler    BBNSM_IRQHandler
    def_irq_handler    SYS_CTR1_IRQHandler
    def_irq_handler    TPM3_EWM_IRQHandler
    def_irq_handler    TPM4_SEMC_IRQHandler
    def_irq_handler    TPM5_LPIT3_IRQHandler
    def_irq_handler    TPM6_LPTMR3_IRQHandler
    def_irq_handler    RTWDOG3_IRQHandler
    def_irq_handler    RTWDOG4_IRQHandler
    def_irq_handler    RTWDOG5_IRQHandler
    def_irq_handler    TRDC_MGR_WKUP_IRQHandler
    def_irq_handler    TMPSNS_INT_IRQHandler
    def_irq_handler    BBSM_IRQHandler
    def_irq_handler    LDO_AON_ANA_IRQHandler
    def_irq_handler    USDHC1_DriverIRQHandler
    def_irq_handler    USDHC2_DriverIRQHandler
    def_irq_handler    TRDC_MGR_MEGA_IRQHandler
    def_irq_handler    SFA_TMR2_IRQHandler
    def_irq_handler    LDO_AON_DIG_IRQHandler
    def_irq_handler    MECC1_IRQHandler
    def_irq_handler    MECC2_IRQHandler
    def_irq_handler    ADC1_IRQHandler
    def_irq_handler    DMA_ERROR_DriverIRQHandler
    def_irq_handler    DMA3_CH0_DriverIRQHandler
    def_irq_handler    DMA3_CH1_DriverIRQHandler
    def_irq_handler    DMA3_CH2_DriverIRQHandler
    def_irq_handler    DMA3_CH3_DriverIRQHandler
    def_irq_handler    DMA3_CH4_DriverIRQHandler
    def_irq_handler    DMA3_CH5_DriverIRQHandler
    def_irq_handler    DMA3_CH6_DriverIRQHandler
    def_irq_handler    DMA3_CH7_DriverIRQHandler
    def_irq_handler    DMA3_CH8_DriverIRQHandler
    def_irq_handler    DMA3_CH9_DriverIRQHandler
    def_irq_handler    DMA3_CH10_DriverIRQHandler
    def_irq_handler    DMA3_CH11_DriverIRQHandler
    def_irq_handler    DMA3_CH12_DriverIRQHandler
    def_irq_handler    DMA3_CH13_DriverIRQHandler
    def_irq_handler    DMA3_CH14_DriverIRQHandler
    def_irq_handler    DMA3_CH15_DriverIRQHandler
    def_irq_handler    DMA3_CH16_DriverIRQHandler
    def_irq_handler    DMA3_CH17_DriverIRQHandler
    def_irq_handler    DMA3_CH18_DriverIRQHandler
    def_irq_handler    DMA3_CH19_DriverIRQHandler
    def_irq_handler    DMA3_CH20_DriverIRQHandler
    def_irq_handler    DMA3_CH21_DriverIRQHandler
    def_irq_handler    DMA3_CH22_DriverIRQHandler
    def_irq_handler    DMA3_CH23_DriverIRQHandler
    def_irq_handler    DMA3_CH24_DriverIRQHandler
    def_irq_handler    DMA3_CH25_DriverIRQHandler
    def_irq_handler    DMA3_CH26_DriverIRQHandler
    def_irq_handler    DMA3_CH27_DriverIRQHandler
    def_irq_handler    DMA3_CH28_SINC3_CH0_DriverIRQHandler
    def_irq_handler    DMA3_CH29_SINC3_CH1_DriverIRQHandler
    def_irq_handler    DMA3_CH30_SINC3_CH2_DriverIRQHandler
    def_irq_handler    DMA3_CH31_SINC3_CH3_DriverIRQHandler
    def_irq_handler    DMA4_ERROR_DriverIRQHandler
    def_irq_handler    DMA4_CH0_CH1_DriverIRQHandler
    def_irq_handler    DMA4_CH2_CH3_DriverIRQHandler
    def_irq_handler    DMA4_CH4_CH5_DriverIRQHandler
    def_irq_handler    DMA4_CH6_CH7_DriverIRQHandler
    def_irq_handler    DMA4_CH8_CH9_DriverIRQHandler
    def_irq_handler    DMA4_CH10_CH11_DriverIRQHandler
    def_irq_handler    DMA4_CH12_CH13_DriverIRQHandler
    def_irq_handler    DMA4_CH14_CH15_DriverIRQHandler
    def_irq_handler    DMA4_CH16_CH17_DriverIRQHandler
    def_irq_handler    DMA4_CH18_CH19_DriverIRQHandler
    def_irq_handler    DMA4_CH20_CH21_DriverIRQHandler
    def_irq_handler    DMA4_CH22_CH23_DriverIRQHandler
    def_irq_handler    DMA4_CH24_CH25_DriverIRQHandler
    def_irq_handler    DMA4_CH26_CH27_DriverIRQHandler
    def_irq_handler    DMA4_CH28_CH29_DriverIRQHandler
    def_irq_handler    DMA4_CH30_CH31_DriverIRQHandler
    def_irq_handler    DMA4_CH32_CH33_DriverIRQHandler
    def_irq_handler    DMA4_CH34_CH35_DriverIRQHandler
    def_irq_handler    DMA4_CH36_CH37_DriverIRQHandler
    def_irq_handler    DMA4_CH38_CH39_DriverIRQHandler
    def_irq_handler    DMA4_CH40_CH41_DriverIRQHandler
    def_irq_handler    DMA4_CH42_CH43_DriverIRQHandler
    def_irq_handler    DMA4_CH44_CH45_DriverIRQHandler
    def_irq_handler    DMA4_CH46_CH47_DriverIRQHandler
    def_irq_handler    DMA4_CH48_CH49_LPI2C5_DriverIRQHandler
    def_irq_handler    DMA4_CH50_CH51_LPI2C6_DriverIRQHandler
    def_irq_handler    DMA4_CH52_CH53_SAI4_DriverIRQHandler
    def_irq_handler    DMA4_CH54_CH55_SPDIF_DriverIRQHandler
    def_irq_handler    DMA4_CH56_CH57_LPUART9_DriverIRQHandler
    def_irq_handler    DMA4_CH58_CH59_LPUART10_DriverIRQHandler
    def_irq_handler    DMA4_CH60_CH61_LPUART11_DriverIRQHandler
    def_irq_handler    LPUART12_DriverIRQHandler
    def_irq_handler    INTG_BOOTROM_DEBUG_CTRL_IRQHandler
    def_irq_handler    EDGELOCK_REQ1_IRQHandler
    def_irq_handler    EDGELOCK_REQ2_IRQHandler
    def_irq_handler    EDGELOCK_REQ3_IRQHandler
    def_irq_handler    DBG_TRACE_TMR3_IRQHandler
    def_irq_handler    JTAGC_TMR4_IRQHandler
    def_irq_handler    M33_SYSRESET_REQ_IRQHandler
    def_irq_handler    M33_LOCKUP_IRQHandler
    def_irq_handler    M7_SYSRESET_REQ_IRQHandler
    def_irq_handler    M7_LOCKUP_IRQHandler
    def_irq_handler    PWM2_FAULT_IRQHandler
    def_irq_handler    PWM2_0_IRQHandler
    def_irq_handler    PWM2_1_IRQHandler
    def_irq_handler    PWM2_2_IRQHandler
    def_irq_handler    PWM2_3_IRQHandler
    def_irq_handler    PWM3_FAULT_IRQHandler
    def_irq_handler    PWM3_0_IRQHandler
    def_irq_handler    PWM3_1_IRQHandler
    def_irq_handler    PWM3_2_IRQHandler
    def_irq_handler    PWM3_3_IRQHandler
    def_irq_handler    PWM4_FAULT_IRQHandler
    def_irq_handler    PWM4_0_IRQHandler
    def_irq_handler    PWM4_1_IRQHandler
    def_irq_handler    PWM4_2_IRQHandler
    def_irq_handler    PWM4_3_IRQHandler
    def_irq_handler    EQDC1_IRQHandler
    def_irq_handler    EQDC2_IRQHandler
    def_irq_handler    EQDC3_IRQHandler
    def_irq_handler    EQDC4_IRQHandler
    def_irq_handler    ADC2_IRQHandler
    def_irq_handler    DCDC_IRQHandler
    def_irq_handler    CAN3_DriverIRQHandler
    def_irq_handler    CAN3_ERROR_DriverIRQHandler
    def_irq_handler    DAC_IRQHandler
    def_irq_handler    LPSPI5_DriverIRQHandler
    def_irq_handler    LPSPI6_DriverIRQHandler
    def_irq_handler    LPUART7_DriverIRQHandler
    def_irq_handler    LPUART8_DriverIRQHandler
    def_irq_handler    SAI2_DriverIRQHandler
    def_irq_handler    SAI3_DriverIRQHandler
    def_irq_handler    ACMP1_IRQHandler
    def_irq_handler    ACMP2_IRQHandler
    def_irq_handler    ACMP3_IRQHandler
    def_irq_handler    ACMP4_IRQHandler
    def_irq_handler    CM7_PS_IRQHandler
    def_irq_handler    CM7_MCM_IRQHandler
    def_irq_handler    CM33_MCM_IRQHandler
    def_irq_handler    ECAT_INT_IRQHandler
    def_irq_handler    SAFETY_CLK_MON_IRQHandler
    def_irq_handler    GPT1_IRQHandler
    def_irq_handler    GPT2_IRQHandler
    def_irq_handler    KPP_IRQHandler
    def_irq_handler    USBPHY1_IRQHandler
    def_irq_handler    USBPHY2_IRQHandler
    def_irq_handler    USB_OTG2_IRQHandler
    def_irq_handler    USB_OTG1_IRQHandler
    def_irq_handler    FLEXSPI_SLV_DriverIRQHandler
    def_irq_handler    NETC_IRQHandler
    def_irq_handler    MSGINTR1_IRQHandler
    def_irq_handler    MSGINTR2_IRQHandler
    def_irq_handler    MSGINTR3_IRQHandler
    def_irq_handler    MSGINTR4_IRQHandler
    def_irq_handler    MSGINTR5_IRQHandler
    def_irq_handler    MSGINTR6_IRQHandler
    def_irq_handler    SINC1_CH0_IRQHandler
    def_irq_handler    SINC1_CH1_IRQHandler
    def_irq_handler    SINC1_CH2_IRQHandler
    def_irq_handler    SINC1_CH3_IRQHandler
    def_irq_handler    SINC2_CH0_IRQHandler
    def_irq_handler    SINC2_CH1_IRQHandler
    def_irq_handler    SINC2_CH2_IRQHandler
    def_irq_handler    SINC2_CH3_IRQHandler
    def_irq_handler    GPIO4_0_IRQHandler
    def_irq_handler    GPIO4_1_IRQHandler
    def_irq_handler    GPIO5_0_IRQHandler
    def_irq_handler    GPIO5_1_IRQHandler
    def_irq_handler    GPIO6_0_IRQHandler
    def_irq_handler    GPIO6_1_IRQHandler
    def_irq_handler    ECAT_RST_OUT_IRQHandler

    .end
